[
    {
        "id": 1,
        "title": "Blade Runner 2049",
        "poster": "/images/blade_runner_2049.jpg",
        "genres": [
            "Sci-Fi",
            "Thriller"
        ],
        "year": 2017,
        "director": "Denis Villeneuve",
        "description": "<p>In a future Los Angeles, K, a replicant blade runner, is sent to retire models that have gone rogue and keep an unstable society under control.</p><br><br><p>During an investigation he discovers evidence that a replicant may have given birth to a child, something believed to be impossible and extremely dangerous for the balance between humans and replicants.</p><br><br><p>His search for the truth forces him to question his own memories and leads him to Rick Deckard, a former blade runner who has been missing for decades.</p>",
        "copies": [
            {
                "owner": "user@mycinemacollector.com",
                "status": "Available",
                "format": "Blu-ray"
            },
            {
                "owner": "user1@mycinemacollector.com",
                "status": "Lent",
                "format": "Digital"
            }
        ]
    },
    {
        "id": 2,
        "title": "La La Land",
        "poster": "/images/la_la_land.jpg",
        "genres": [
            "Musical",
            "Romance",
            "Drama"
        ],
        "year": 2016,
        "director": "Damien Chazelle",
        "description": "<p>Mia dreams of becoming an actress and spends her days working at a studio coffee shop while going from one failed audition to the next.</p><br><br><p>Sebastian is a jazz pianist obsessed with opening his own club and keeping the music he loves alive, even if that means clashing with everyone around him.</p><br><br><p>When their paths cross, their relationship becomes the push they both need to chase their goals, but it also brings tough choices about love, success and the cost of their dreams.</p>",
        "copies": [
            {
                "owner": "user@mycinemacollector.com",
                "status": "Available",
                "format": "Blu-ray"
            },
            {
                "owner": "user2@mycinemacollector.com",
                "status": "Reserved",
                "format": "DVD"
            }
        ]
    },
    {
        "id": 3,
        "title": "The Nice Guys",
        "poster": "/images/the_nice_guys.jpg",
        "genres": [
            "Comedy",
            "Action",
            "Crime"
        ],
        "year": 2016,
        "director": "Shane Black",
        "description": "<p>In late‑1970s Los Angeles, Holland March is a clumsy, down‑on‑his‑luck private investigator who barely survives on minor cases.</p><br><br><p>Jackson Healy is a hired enforcer who makes a living intimidating people, until a seemingly simple job puts him on a collision course with March.</p><br><br><p>Together they investigate the disappearance of a young woman linked to the adult‑film industry and uncover a conspiracy involving businessmen, politicians and a long list of very bad decisions.</p>",
        "copies": [
            {
                "owner": "user1@mycinemacollector.com",
                "status": "Available",
                "format": "Digital"
            }
        ]
    },
    {
        "id": 4,
        "title": "Drive",
        "poster": "/images/drive.jpg",
        "genres": [
            "Action",
            "Crime",
            "Thriller"
        ],
        "year": 2011,
        "director": "Nicolas Winding Refn",
        "description": "<p>A quiet, reserved driver works as a movie stuntman by day and as a getaway driver for criminals by night, following a strict personal code.</p><br><br><p>When he grows close to his neighbor Irene and her young son, he decides to help the family escape a dangerous debt connected to her recently released husband.</p><br><br><p>The plan falls apart and triggers a chain of violence involving gangsters and betrayals, forcing the driver to become far more lethal in order to protect the few people he cares about.</p>",
        "copies": [
            {
                "owner": "user@mycinemacollector.com",
                "status": "Available",
                "format": "4K UHD"
            },
            {
                "owner": "user4@mycinemacollector.com",
                "status": "Lent",
                "format": "Blu-ray"
            }
        ]
    },
    {
        "id": 5,
        "title": "Crazy, Stupid, Love",
        "poster": "/images/crazy_stupid_love.jpg",
        "genres": [
            "Romance",
            "Comedy"
        ],
        "year": 2011,
        "director": "Glenn Ficarra, John Requa",
        "description": "<p>Cal Weaver thinks he has a perfect life until his wife confesses during dinner that she has been unfaithful and wants a divorce.</p><br><br><p>Lost and depressed, he starts frequenting a bar where he meets Jacob, a confident ladies' man who decides to transform him and teach him how to navigate the modern dating world.</p><br><br><p>As Cal changes, everyone around him becomes entangled in a web of crossed crushes, uncomfortable secrets and situations that are as ridiculous as they are heartfelt.</p>",
        "copies": [
            {
                "owner": "user1@mycinemacollector.com",
                "status": "Available",
                "format": "DVD"
            }
        ]
    },
    {
        "id": 6,
        "title": "Barbie",
        "poster": "/images/barbie.webp",
        "genres": [
            "Comedy",
            "Adventure",
            "Fantasy"
        ],
        "year": 2023,
        "director": "Greta Gerwig",
        "description": "<p>In Barbieland everything is bright, perfect and designed so that every day feels exactly the same and perfectly happy, until one Barbie starts having unsettling thoughts about death and the meaning of her life.</p><br><br><p>To understand what is happening, she travels to the real world with Ken and discovers a far more complex society where the image of Barbie has had a contradictory impact on generations of girls and women.</p><br><br><p>Through meta humor, emotional moments and surreal situations, the film deconstructs and reimagines the Barbie myth while the characters try to decide who they really want to be.</p>",
        "copies": [
            {
                "owner": "user@mycinemacollector.com",
                "status": "Available",
                "format": "4K UHD"
            },
            {
                "owner": "user3@mycinemacollector.com",
                "status": "Lent",
                "format": "Blu-ray"
            }
        ]
    },
    {
        "id": 7,
        "title": "The Place Beyond the Pines",
        "poster": "/images/the_place_beyond_the_pines.jpg",
        "genres": [
            "Crime",
            "Drama",
            "Thriller"
        ],
        "year": 2012,
        "director": "Derek Cianfrance",
        "description": "<p>Luke, a motorcycle stunt rider for a travelling fair, discovers he has a baby son from a past relationship and decides to stay in town to try to provide for him.</p><br><br><p>Without money or stability, he starts robbing banks using his riding skills, putting himself on the radar of Avery, an ambitious young police officer struggling with his own moral dilemmas.</p><br><br><p>Years later, the choices of both men resurface when their sons meet and are dragged into a legacy of guilt, violence and buried family secrets.</p>",
        "copies": [
            {
                "owner": "user1@mycinemcollector.com",
                "status": "Available",
                "format": "Blu-ray"
            }
        ]
    },
    {
        "id": 8,
        "title": "The Gray Man",
        "poster": "/images/the_gray_man.jpg",
        "genres": [
            "Action",
            "Thriller"
        ],
        "year": 2022,
        "director": "Anthony Russo, Joe Russo",
        "description": "<p>Court Gentry, recruited out of prison to work as a covert assassin for the CIA, becomes one of the agency's most effective and anonymous operatives.</p><br><br><p>When he uncovers compromising information about internal corruption, he refuses to follow orders and becomes the target of an international manhunt led by an unstable former colleague.</p><br><br><p>With few allies and mercenaries chasing him across the globe, he has to stay alive long enough to decide what to do with the dangerous truth he now holds.</p>",
        "copies": [
            {
                "owner": "user@mycinemacollector.com",
                "status": "Available",
                "format": "Digital"
            },
            {
                "owner": "user1@mycinemacollector.com",
                "status": "Reserved",
                "format": "Blu-ray"
            }
        ]
    }
]